openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc_560x.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/

#include <assert.h>
#include <stdlib.h>
//#include "System.h"
#include "mpc55xx.h"
#include "Modules.h"
#include "Mcu.h"
#include "Adc.h"
#include "Det.h"
#include "Os.h"
#include "isr.h"
#include "irq.h"
#include "arc.h"

/* Uncomment and use DMA for 5606 only if you now what you are doing */
#define DONT_USE_DMA_IN_ADC_MPC560X

/* Are we gonna use Dma? */
#if ( defined(CFG_MPC5606S) && !defined(DONT_USE_DMA_IN_ADC_MPC560X) )
	#define ADC_USES_DMA
	#include "Dma.h"
#endif

#if ( defined(ADC_USES_DMA) && !defined(USE_DMA) )
	#error Adc is configured to use Dma but the module is not enabled.
#endif

#define ADC_GROUP0		0

typedef enum
{
  ADC_UNINIT,
  ADC_INIT,
}Adc_StateType;

/* Function prototypes. */
static void Adc_ConfigureADC (const Adc_ConfigType *ConfigPtr);
static void Adc_ConfigureADCInterrupts (void);

void Adc_GroupConversionComplete (Adc_GroupType group);

/* Development error checking. */
static Std_ReturnType Adc_CheckReadGroup (Adc_GroupType group);
static Std_ReturnType Adc_CheckStartGroupConversion (Adc_GroupType group);
static Std_ReturnType Adc_CheckStopGroupConversion (Adc_GroupType group);
static Std_ReturnType Adc_CheckInit (const Adc_ConfigType *ConfigPtr);
#if (ADC_DEINIT_API == STD_ON)
static Std_ReturnType Adc_CheckDeInit (void);
#endif
static Std_ReturnType Adc_CheckSetupResultBuffer (Adc_GroupType group);
static Std_ReturnType Adc_CheckGetStreamLastPointer (Adc_GroupType group);

/* static variable declarations */
static Adc_StateType adcState = ADC_UNINIT;
static const Adc_ConfigType *AdcConfigPtr;      /* Pointer to configuration structure. */

/* Validate functions used for development error check */
#if ( ADC_DEV_ERROR_DETECT == STD_ON )
Std_ReturnType ValidateInit(Adc_APIServiceIDType api)
{
	Std_ReturnType res = E_OK;
	if(!(ADC_INIT == adcState)) {
		Det_ReportError(MODULE_ID_ADC,0,api,ADC_E_UNINIT );
		res = E_NOT_OK;
	}
	return res;
}
Std_ReturnType ValidateGroup(Adc_GroupType group,Adc_APIServiceIDType api)
{
	Std_ReturnType res = E_OK;
	if(!((group >= 0) && (group < AdcConfig->nbrOfGroups))) {
		Det_ReportError(MODULE_ID_ADC,0,api,ADC_E_PARAM_GROUP );
		res = E_NOT_OK;
	}
	return res;
}
#endif

#if (ADC_DEINIT_API == STD_ON)
Std_ReturnType Adc_DeInit (const Adc_ConfigType *ConfigPtr)
{
  (void)ConfigPtr;

  if (E_OK == Adc_CheckDeInit())
  {
    for(Adc_GroupType group = ADC_GROUP0; group < AdcConfigPtr->nbrOfGroups; group++)
    {
      /* Set group status to idle. */
      AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;
    }

    /* Disable DMA transfer*/
#ifndef CFG_MPC5604B
    ADC_0.DMAE.B.DMAEN = 0;
#endif
    /* Power down ADC */
    ADC_0.MCR.R = 0x0001;

    /* Disable all interrupt*/
    ADC_0.IMR.R = 0;

    /* Clean internal status. */
    AdcConfigPtr = (Adc_ConfigType *)NULL;
    adcState = ADC_UNINIT;
  }

  return (E_OK);
}
#endif

Std_ReturnType Adc_Init (const Adc_ConfigType *ConfigPtr)
{
  if (E_OK == Adc_CheckInit(ConfigPtr))
  {
            /* First of all, store the location of the configuration data. */
            AdcConfigPtr = ConfigPtr;

            /* Enable ADC. */
             Adc_ConfigureADC(ConfigPtr);

             Adc_ConfigureADCInterrupts();

            /* Move on to INIT state. */
            adcState = ADC_INIT;
            return E_OK;
  }
  else
  {
    return E_NOT_OK;
  }
}

Std_ReturnType Adc_SetupResultBuffer (Adc_GroupType group, Adc_ValueGroupType *bufferPtr)
{
  Std_ReturnType returnValue = E_NOT_OK;

  /* Check for development errors. */
  if (E_OK == Adc_CheckSetupResultBuffer (group))
  {
    AdcConfigPtr->groupConfigPtr[group].status->resultBufferPtr = bufferPtr;
    
    returnValue = E_OK;
  }

  return (returnValue);
}

Adc_StreamNumSampleType Adc_GetStreamLastPointer(Adc_GroupType group, Adc_ValueGroupType** PtrToSamplePtr)
{
	Adc_StreamNumSampleType nofSample = 0;
	Adc_GroupDefType *groupPtr = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];
	
	/** @req ADC216 */
	/* Check for development errors. */
	if ( (E_OK == Adc_CheckGetStreamLastPointer (group)) &&
		 (groupPtr->status->groupStatus != ADC_BUSY) )
	{
	    /* Set resultPtr to application buffer. */
		if(groupPtr->status->currSampleCount > 0){
			*PtrToSamplePtr = &groupPtr->status->resultBufferPtr[groupPtr->status->currSampleCount-1];
		}

	    if ((ADC_CONV_MODE_ONESHOT == groupPtr->conversionMode) &&
	        (ADC_STREAM_COMPLETED  == groupPtr->status->groupStatus))
	    {
			/** @req ADC327. */
			groupPtr->status->groupStatus = ADC_IDLE;
	    }
	    else if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
	             (ADC_ACCESS_MODE_STREAMING == groupPtr->accessMode) &&
	             (ADC_STREAM_BUFFER_LINEAR == groupPtr->streamBufferMode) &&
	             (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
	    {
			/** @req ADC327. */
			groupPtr->status->groupStatus = ADC_IDLE;
	    }
	    else if ( (ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
	              ((ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus) ||
	               (ADC_COMPLETED           == groupPtr->status->groupStatus)) )
	    {
	        /* Restart continous mode, and reset result buffer */
	        if ((ADC_CONV_MODE_CONTINOUS == groupPtr->conversionMode) &&
	            (ADC_STREAM_COMPLETED    == groupPtr->status->groupStatus))
	        {
	  		  /* Start continous conversion again */
	        	Adc_StartGroupConversion(group);
	        }
			/** @req ADC326 */
			/** @req ADC328 */
	    }
	    else{/* Keep status. */}
	}
	else
	{
		/* Some condition not met */
		*PtrToSamplePtr = NULL;
	}

