openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Adc_560x.c
void Adc_WatchdogError (void){
}
void Adc_ADCError (void){
}

static void  Adc_ConfigureADC (const Adc_ConfigType *ConfigPtr)
{
  /* Set ADC CLOCK */
  ADC_0.MCR.B.ADCLKSEL = ConfigPtr->hwConfigPtr->adcPrescale;

  ADC_0.DSDR.B.DSD = 254;

  /* Power on ADC */
  ADC_0.MCR.B.PWDN = 0;

#if defined(ADC_USES_DMA)
  /* Enable DMA. */
  ADC_0.DMAE.B.DMAEN = 1;
#endif
}

void Adc_ConfigureADCInterrupts (void)
{
	ISR_INSTALL_ISR2(  "Adc_Err", Adc_ADCError, ADC_ER_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Grp", Adc_Group0ConversionComplete, ADC_EOC_INT,     2, 0 );
	ISR_INSTALL_ISR2(  "Adc_Wdg", Adc_WatchdogError, ADC_WD_INT,     2, 0 );
}

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
void Adc_StartGroupConversion (Adc_GroupType group)
{
	Adc_GroupDefType *groupPtr = (Adc_GroupDefType *)&AdcConfigPtr->groupConfigPtr[group];

	/* Run development error check. */
	if (E_OK == Adc_CheckStartGroupConversion (group))
	{
		/* Disable trigger normal conversions for ADC0 */
		ADC_0.MCR.B.NSTART = 0;

		/* Set group state to BUSY. */
		groupPtr->status->groupStatus = ADC_BUSY;

		groupPtr->status->currSampleCount = 0;
		groupPtr->status->currResultBufPtr = groupPtr->status->resultBufferPtr; /* Set current result buffer */

#if defined(ADC_USES_DMA)
		Dma_ConfigureChannel ((Dma_TcdType *)groupPtr->groupDMAResults, groupPtr->dmaResultChannel);
		Dma_ConfigureDestinationAddress ((uint32_t)groupPtr->status->currResultBufPtr, groupPtr->dmaResultChannel);
#endif
		/* Always use single shot in streaming mode */
		if( groupPtr->accessMode == ADC_ACCESS_MODE_STREAMING)
		{
			/* Set conversion mode. */
			ADC_0.MCR.B.MODE = ADC_CONV_MODE_ONESHOT;
		}
		else
		{
			/* Set conversion mode. */
			ADC_0.MCR.B.MODE = groupPtr->conversionMode;
		}

		/* Enable Overwrite*/
		ADC_0.MCR.B.OWREN = 1;

		/* Set Conversion Time. */
#if defined(CFG_MPC5606S)
		uint32 groupChannelIdMask = 0;

		ADC_0.CTR[1].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[1].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[1].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;

		for(uint8 i =0; i < groupPtr->numberOfChannels; i++)
		{
			groupChannelIdMask |= (1 << groupPtr->channelList[i]);
		}

#if defined(ADC_USES_DMA)
		ADC_0.DMAE.R = 0x01;
		/* Enable DMA Transfer */
		ADC_0.DMAR[1].R = groupChannelIdMask;
		Dma_StartChannel(DMA_ADC_GROUP0_RESULT_CHANNEL);        /* Enable EDMA channel for ADC */
#endif

		/* Enable Normal conversion */
		ADC_0.NCMR[1].R = groupChannelIdMask;

		/* Enable Channel Interrupt */
		ADC_0.CIMR[1].R = groupChannelIdMask;

#else
		uint32 groupChannelIdMask[3] = {0,0,0};

		ADC_0.CTR[0].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[0].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[0].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;
		ADC_0.CTR[1].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[1].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[1].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;
		ADC_0.CTR[2].B.INPLATCH = groupPtr->adcChannelConvTime.INPLATCH;
		ADC_0.CTR[2].B.INPCMP = groupPtr->adcChannelConvTime.INPCMP;
		ADC_0.CTR[2].B.INPSAMP = groupPtr->adcChannelConvTime.INPSAMP;

		for(uint8 i =0; i < groupPtr->numberOfChannels; i++)
		{
			if(groupPtr->channelList[i] <= 15){
				groupChannelIdMask[0] |= (1 << groupPtr->channelList[i]);
			}else if((groupPtr->channelList[i] >= 32) && (groupPtr->channelList[i] <=47)){
				groupChannelIdMask[1] |= (1 << (groupPtr->channelList[i] - 32));
			}else if((groupPtr->channelList[i] >= 64) && (groupPtr->channelList[i] <=95)){
				groupChannelIdMask[2] |= (1 << (groupPtr->channelList[i] - 64));
			}
		}

		/* Enable Normal conversion */
		ADC_0.NCMR[0].R = groupChannelIdMask[0];
		ADC_0.NCMR[1].R = groupChannelIdMask[1];
		ADC_0.NCMR[2].R = groupChannelIdMask[2];

		/* Enable Channel Interrupt */
		ADC_0.CIMR[0].R = groupChannelIdMask[0];
		ADC_0.CIMR[1].R = groupChannelIdMask[1];
		ADC_0.CIMR[2].R = groupChannelIdMask[2];
#endif
		/* Clear interrupts */
		ADC_0.ISR.B.ECH = 1;
		/* Enable ECH interrupt */
		ADC_0.IMR.B.MSKECH = 1;

		/* Trigger normal conversions for ADC0 */
		ADC_0.MCR.B.NSTART = 1;
	}
	else
	{
	/* Error have been set within Adc_CheckStartGroupConversion(). */
	}
}

void Adc_StopGroupConversion (Adc_GroupType group)
{
  if (E_OK == Adc_CheckStopGroupConversion (group))
  {
	/* Disable trigger normal conversions for ADC0 */
	ADC_0.MCR.B.NSTART = 0;

	/* Set group state to IDLE. */
	AdcConfigPtr->groupConfigPtr[group].status->groupStatus = ADC_IDLE;

	/* Disable group notification if enabled. */
    if(1 == AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable){
    	Adc_DisableGroupNotification (group);
    }
  }
  else
  {
	/* Error have been set within Adc_CheckStartGroupConversion(). */
  }
}
#endif  /* endof #if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#define SYSTEM_CLOCK_DIVIDE(f)    ((f / 2) - 1)

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
void Adc_EnableGroupNotification (Adc_GroupType group)
{
	Std_ReturnType res;

#if ( ADC_DEV_ERROR_DETECT == STD_ON )
	if( (ValidateInit(ADC_ENABLEGROUPNOTIFICATION_ID) == E_NOT_OK) ||
		(ValidateGroup(group, ADC_ENABLEGROUPNOTIFICATION_ID) == E_NOT_OK))
	{
		res = E_NOT_OK;
	}
	else if (AdcConfigPtr->groupConfigPtr[group].groupCallback == NULL)
	{
		res = E_NOT_OK;
		Det_ReportError(MODULE_ID_ADC,0,ADC_ENABLEGROUPNOTIFICATION_ID ,ADC_E_NOTIF_CAPABILITY );
	}
	else
	{
		/* Nothing strange. Go on... */
		res = E_OK;
	}
#else
	res = E_OK;
#endif
	if (E_OK == res){
		AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 1;
	}
}

void Adc_DisableGroupNotification (Adc_GroupType group)
{
	Std_ReturnType res;

#if ( ADC_DEV_ERROR_DETECT == STD_ON )
	if( (ValidateInit(ADC_DISABLEGROUPNOTIFICATION_ID) == E_NOT_OK) ||
		(ValidateGroup(group, ADC_DISABLEGROUPNOTIFICATION_ID) == E_NOT_OK))
	{
		res = E_NOT_OK;
	}
	else if (AdcConfigPtr->groupConfigPtr[group].groupCallback == NULL)
	{
		res = E_NOT_OK;
		Det_ReportError(MODULE_ID_ADC,0,ADC_DISABLEGROUPNOTIFICATION_ID ,ADC_E_NOTIF_CAPABILITY );
	}
	else
	{
		/* Nothing strange. Go on... */
		res = E_OK;
	}
#else
	res = E_OK;
#endif
	if (E_OK == res){
		AdcConfigPtr->groupConfigPtr[group].status->notifictionEnable = 0;
	}
}
#endif



/* Development error checking functions. */
#if (ADC_READ_GROUP_API == STD_ON)
static Std_ReturnType Adc_CheckReadGroup (Adc_GroupType group)
{
  Std_ReturnType returnValue = E_OK;

#if ( ADC_DEV_ERROR_DETECT == STD_ON )

  if( (ValidateInit(ADC_READGROUP_ID) == E_NOT_OK) ||
      (ValidateGroup(group, ADC_READGROUP_ID) == E_NOT_OK))
  {
	  returnValue = E_NOT_OK;
  }
  else if (ADC_IDLE == AdcConfigPtr->groupConfigPtr[group].status->groupStatus)
  {
    /* ADC388. */
    returnValue = E_NOT_OK;
    Det_ReportError(MODULE_ID_ADC,0,ADC_READGROUP_ID ,ADC_E_IDLE );
  }
  else
  {
    /* Nothing strange. Go on... */
    returnValue = E_OK;
  }
#endif
  return (returnValue);
}
#endif

